# https://wikidocs.net/78562

#131
# 한라인이 모두 출력이 아니라 한라인에 하니씩 출력한다
"""
과일 = ["사과", "귤", "수박"]
for 변수 in 과일:
    print(변수)
"""
"""
사과
귤
수박
"""

#132
# 과일에는 3개의 데이터가 있기에 그만큼 출력한다
"""
과일 = ["사과", "귤", "수박"]
for 변수 in 과일:
  print("#####")
"""
"""
#####
#####
#####
"""

#133
"""
for 변수 in ["A", "B", "C"]:
  print(변수)
#풀어서 작성
print("A")
print("B")
print("C")
"""

#134
"""
for 변수 in ["A", "B", "C"]:
  print("출력:", 변수)
#풀어서 작성
print("출력: A")
print("출력: B")
print("출력: C")
"""

#135
"""
for 변수 in ["A", "B", "C"]:
  b = 변수.lower()
  print("변환:", b)
# 풀어서 작성
print("변환: a")
print("변환: b")
print("변환: c")
"""

#136
"""
for 변수 in [10, 20, 30]:
    print(변수)
"""

#137
"""
for 변수 in [10, 20, 30]:
    print(변수)
"""

#138
"""
for 변수 in [10, 20, 30]:
    print(변수)
    print("-------")
"""

#139
"""
print("++++")
for 변수 in [10, 20, 30]:
    print(변수)
"""

#140
"""
for 변수 in [10, 20, 30, 40]:
    print("-------")
"""